# Добавить код Hello World / Создание проекта / NetBeans / Java / MarBug / Courses

| Language | Язык | Мова |
| -------- | ---- | ---- |
| [English](README.md) | **Русский / Russian** | [Українська / Ukrainian](README.uk.md) |

Вставьте следующий код

    public static void main(String[] args) {
        System.out.println("Hello, World");
    }

внутрь

    public class GitManagerApp {

    }

т.е в результате должно получиться:

    public class GitManagerApp {
        public static void main(String[] args) {
            System.out.println("Hello, World");
        }
    }

## Пример реализации ##

Изменения можно посмотреть по одной из следующих ссылок:

* [GitHub](https://github.com/marbug/courses-marbug-java/blob/v0.5_add-hello-world-code/git-manager-app/GitManagerApp/src/main/java/com/mycompany/gitmanagerapp/GitManagerApp.java)
* [Bitbucket](https://bitbucket.org/marbug/courses-marbug-java/src/d592cefd1b637a1e54531c902037c6788d3052f6/git-manager-app/GitManagerApp/src/main/java/com/mycompany/gitmanagerapp/GitManagerApp.java?at=v0.5_add-hello-world-code&fileviewer=file-view-default)

## Детальное описание ##

### Метод / функция ###

Как правило класс имеет методы (иногда их могут называть "функции"), которые позволяют выполнять какие-то действия.

Например, машина должна уметь заводиться, увеличивать скорость движения ("газовать"), уменьшать скорость движения ("тормозить"), увеличивать количество топлива в баке (бензин / дизель / газ) или количество заряда (если это "электрическое" авто). 

Флакон с духами может пахнуть, выветриваться, можно долить духи во флакон, а можно и вылить их из флакона (если надоели), др.

Т.е. для каждого действия у класса должен быть соответствующий метод / функция.

В нашем случае нужен метод, который будет означать начало выполнения программы. Этот метод принято называть именно **main**.  

### public ###

**public** (помните, как правильно читается? смотрите на прошлой странице, если забыли) - это "служебное слово" языка Ява, которое означает, что данный метод (функция) может быть использован из других пакетов.

### static ###

**static** (читается **стАтик**) - это "служебное слово" языка Ява, которое означает, что данный метод / фукнция может вызываться напрямую (в нашем случае Ява будет делать это так: **GitManagerApp.main**, но Ява нам об этом не скажет - это действие по-умолчанию).

### void ###

**void** (читается **вОид**) - это "служебное слово" языка Ява, которое означает, что данный метод / функция "не вернёт" нам ничего после выполнения.

Что это значит "не вернёт"? А может "вернуть"? Может.

Например, мы ходим узнать, сколько топлива или заряда у данной машины, или же сколько духов во флаконе. Для этого нужно "запустить" соответствующий код. Для этого "запускают" (чаще говорят "вызывают") соответствущий метод. Например, "узнатьКоличествоТопливаВБаке" (**getGasInTank**) или "узнатьКоличествоДуховВоФлаконе" (**getPerfumeInBottle**). Тогда вместо **void** будет стоять **double** или **float** или даже ... Но об этом потом.

Главное на данный момент запомнить, что если нам не важен результат выполнения метода/функции, то перед его/её именем должно стоять **void**.

### main ###

**main** (читается мЭин) - это и есть название нашего метода/функции. Как я писал выше, это название используется по-умолчанию для запуска любой программы на Яве. Важно это запомнить. Есть маленькое "но", но об этом поговорим позже ;) 

### String[] args ###

Тоже поговорим об этом позже - по-моему лучше для понимания рассмотреть на примерах. 

Если очень любопытно, то вот кратко: метод/функция может иметь "параметры".

Что такое параметры?

Например, мы хотим долить топливо в бак или долить духов во флакон. Метод/функция должна каким-то образом получать это значение. И код теперь становится похожим на задачу по математике:

    Допустим у нас в баке/флаконе имеется X единиц жидкости. 
    Мы долили Y единиц жидкости. 
    Сколько единиц жидкости стало в баке/флаконе?  

В этом случае нам нужен метод/функция "долитьЖидкостьВБак" (**addGasToTank**) или "долитьЖидкостьВоФлакон" (**addPerfumeToBottle**). Т.е.

    addGasToTank(y) {
        z = x + y;
        ...
    }

или

    addPerfumeToBottle(y) {
        z = x + y;
        ...
    }

Но опять же. Это строго для краткого примера. Детальнее поговорим потом. Главное: метод/функция **main** по-умолчанию получает параметр с названием **args** (вот так вот принято называть вместо **Y**). И тип этого параметра **String[]** (угу, мало того, что **String**, так и ещё и с квадратными скобками после него - не удивляйтесь). Давайте об этом поговорим позже, а то очень далеко уйдём в сторону от текущей задачи.

TODO

| Навигация                |
| ------------------------ |
| [Вверх](../README.ru.md) |
